<?php
/**
 * @authors Liangzi King (1990818918@qq.com)
 * @date    2016-10-15 15:59:19
 * @version $Id$
 */

/**
运算符
9 算术
10 比较
11 三元
12 逻辑
13 递增递减
14



*/
$a = 10;
$b = 0;
//echo $a / $b; //除数不能为0

echo "<br />";

$a = 32000000000;
$b = 32000000000;
$c = $a + $b;
var_dump($c);

echo "<br />";

$a = -10; //换成10,-10各试
$b = -3; //换成3,-3各试
$c = $a % $b;
var_dump($c); //取模算法是,结果的正负仅取决于被除数


//=================比较运算符=================//
//凡比较,必有其运算结果,比较运算符的运算结果是布尔型值

echo "<br />";
$a = 3;
$b = -5;
$c = ($a > $b);
var_dump($c,'<br />');
echo "<br />";
$c = ($a == $b);
var_dump($c,'<br />');

//全等于
$a = 5;
$b = '5';
var_dump($a == $b,'<br />');
var_dump($a === $b,'<br />');

?>