<?php
/**
 * @authors Liangzi King (1990818918@qq.com)
 * @date    2016-10-17 16:07:57
 * @version $Id$
 */

/** 数组讲解
35: 数组的提点及声明方式

36: 索引数字,关联数组,多维数组
37: 键的规则
38: 操作数组单元
39: 循环数组
40: 游标操作
41: 常用函数及面试题
*****/
// 数组是一种复合数据,可以装下多个值,每个值用不同的键来区分.
$arr = array('001'=>'春','002'=>'夏','003'=>'秋','004'=>'冬' );
print_r($arr);

echo '<br />';
// 36: 索引数字,关联数组,多维数组
$arr = array(0 =>'东' ,1=>'南',3=>'西' );  //键不比有特殊意义,纯数字,这种叫"索引数组"
$stu = array('name' =>'小化' ,'age'=>30 ); //字符串做键,一般能体现该单元的内容如age->年龄,这种叫"关联数组"
$arr = array(0 =>'a' , 1=>array('stu'=>'li','bag'=>array('yuwen','shuxue'))); //多维数组
print_r($arr);


echo '<br />';
// 37: 键的规则
// 如果不声明键,会从0 1 2..递增来生成键,
$arr = array('a','b','c');
print_r($arr);
echo '<br />';
$arr = array(3=>'a','b','c');
print_r($arr);


echo '<br />';
// 如果键声明的值重复了,后面的值覆盖前面的值
$arr = array(3=>'a',3=>'b','c');
print_r($arr);


echo '<br />';
// 键可以是整数,也可以是字符串
// 浮点数转成整数,如果字符串的内容恰好是整数,也理解为整数.
$arr = array(2 =>'布' ,2.5=>'尔','2.5'=>'教' ,'2x'=>'育');
print_r($arr);





echo '<br />';




?>