<?php
/**
 * @authors Liangzi King (1990818918@qq.com)
 * @date    2016-10-24 19:55:27
 * @version $Id$
 */

/** 
第46课 进制详解


*/

// 10进制
echo 123,'<br>'; // 右到左3个位,分别是以1顶1,以1顶10,以1顶100
echo 1*3+10*2+100*1,'<br>';

// 8进制,前面加0代表0进制
echo 0123,'<br>'; // 右到左3个位,分别是以1顶1,以1顶8,以1顶64
echo 027,'<br>'; // 23

// 16进制,前面加0x  0-9 a-e
echo 0x123,'<br>'; // 右到左3个位,分别是以1顶1,以1顶8,以1顶64 //291
echo 0x1c; // 28

// 2进制,PHP目前不支持直接表示
// 右到左,分别是以1顶1,以1顶2,以1顶8..... 
/**
10进制    2进制
5         0000 0101
255       1111 1111, 拆分128+64+32+16+8+2+1
-1		  1111 1111, 负数=整数-265
像上面8个1,到底理解成255,还是-1
这个取决于程序.
比如在mysql中,int则理解为-1,unsigned int 理解为255.
*/




?>