<?php
/**
 * @authors Liangzi King (1990818918@qq.com)
 * @date    2016-10-24 20:18:30
 * @version $Id$
 */

/** 
第46课 位运算
是针对字节上的位来进行运算
把位的0/1当成假/真,针对每个位上的逻辑运算,就是位运算.
10进制     2进制
 5		    0000 0101
 12         0000 1100
&           ---------
            0000 0100
|           ---------
            0000 1101
^           ---------
			0000 1001
~5   		1111 1010	
*/
echo 5 & 12,'<br>';  //4
echo 5 | 12,'<br>'; //13
echo 5 ^ 12,'<br>'; //9
echo ~5,'<br>'; // -6 , 1111 1010

// 利用位运算的左移,是整数增大2倍
$a = 3;
echo $a << 1,'<br>';
echo $a << 2,'<br>';

$a = 3;
echo $a >> 1,'<br>';
echo 8 >> 2,'<br>';



?>